**`baseimages/rhel_7_9`** terragrunt plan on `pull_request` event [#39](${url})

```
[0m[1mmodule.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...[0m[0m
[0m[1mmodule.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...[0m[0m
[0m[1mdata.aws_secretsmanager_secret.environment_management: Reading...[0m[0m
[0m[1mmodule.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s[0m
[0m[1mmodule.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s[0m
[0m[1mdata.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-2:946070829339:secret:environment_management-BLRCDb][0m
[0m[1mdata.aws_secretsmanager_secret_version.environment_management: Reading...[0m[0m
[0m[1mdata.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-2:946070829339:secret:environment_management-BLRCDb|AWSCURRENT][0m
[0m[1mmodule.imagebuilder.data.aws_imagebuilder_component.this["aws-cli-version-2-linux"]: Reading...[0m[0m
[0m[1mmodule.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-linux"]: Reading...[0m[0m
[0m[1mmodule.imagebuilder.data.aws_ami.parent: Reading...[0m[0m
[0m[1mmodule.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Reading...[0m[0m
[0m[1mmodule.imagebuilder.data.aws_ami.parent: Read complete after 0s [id=ami-0c2f9865057c3dfe1][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 1s [id=374269020027][0m
[0m[1mdata.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...[0m[0m
[0m[1mdata.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=12984197-3371-4c21-8e43-a88a1581e691][0m
[0m[1mmodule.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-linux"]: Read complete after 1s [id=arn:aws:imagebuilder:eu-west-2:aws:component/amazon-cloudwatch-agent-linux/1.0.1/1][0m
[0m[1mmodule.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=arn:aws:imagebuilder:eu-west-2:aws:component/update-linux/1.0.2/1][0m
[0m[1mmodule.imagebuilder.data.aws_imagebuilder_component.this["aws-cli-version-2-linux"]: Read complete after 1s [id=arn:aws:imagebuilder:eu-west-2:aws:component/aws-cli-version-2-linux/1.0.3/1][0m
[0m[1mmodule.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Read complete after 2s [id=arn:aws:imagebuilder:eu-west-2:aws:component/stig-build-linux-medium/2022.3.2/1][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.imagebuilder.aws_imagebuilder_component.this["../baseimages/components/ansible.yml.tftpl"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_imagebuilder_component" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mdata[0m[0m         = <<-EOT
            ---
            name: baseimage_rhel_7_9_ansible
            description: Install ansible roles for baseimage_rhel_7_9
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.0.1
                  description: Uses the recipe version to avoid any issues with the branch template arg.
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  # Install ansible roles
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          repo="modernisation-platform-ami-builds"
                          ami_tag="baseimage_rhel_7_9"
            
                          # clone ansible roles and playbook
                          ansible_dir=$(mktemp -d)
                          echo "Cloning $repo into $ansible_dir using branch=main"
                          cd $ansible_dir
                          git clone -b main "https://github.com/ministryofjustice/$repo.git"
            
                          # set python version
                          if [[ $(which python3.9) ]]; then
                            python=$(which python3.9)
                          elif [[ $(which python3.6) ]]; then
                            python=$(which python3.6)
                          else
                            echo "Python3.9/3.6 not found"
                            exit 1
                          fi
                          echo "python: $python"
            
                          # install python dependencies outside of virtual env so ansible
                          # can be executed remotely
                          cd $ansible_dir/$repo/ansible
                          $python -m pip install -r requirements.txt
            
                          # activate virtual environment
                          mkdir $ansible_dir/python-venv && cd "$_"
                          $python -m venv ansible
                          source ansible/bin/activate
                          $python -m pip install --upgrade pip
                          if [[ "$python" =~ 3.6 ]]; then
                            $python -m pip install wheel
                            $python -m pip install cryptography==2.3
                            export LC_ALL=en_US.UTF-8
                            $python -m pip install ansible-core==2.11.12
                          else
                            $python -m pip install ansible==6.0.0
                          fi
            
                          # install requirements in virtual env
                          cd $ansible_dir/$repo/ansible
                          $python -m pip install -r requirements.txt
                          ansible-galaxy role install -r requirements.yml
                          ansible-galaxy collection install -r requirements.yml --force
            
                          # run ansible (note comma after localhost is deliberate)
                          ansible-playbook site.yml \
                          --connection=local \
                          --inventory localhost, \
                          --extra-vars "ansible_python_interpreter=$python" \
                          --extra-vars "target=localhost" \
                          --extra-vars "@group_vars/ami_$ami_tag.yml" \
                          --tags amibuild \
                          --become
            
                          # Cleanup
                          deactivate
                          echo "Cleaning up $ansible_dir"
                          rm -rf $ansible_dir/$repo
                          rm -rf $ansible_dir/python-venv
                          rmdir $ansible_dir
        EOT
      [32m+[0m [0m[1m[0mdate_created[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m  = "Install ansible roles for baseimage_rhel_7_9"
      [32m+[0m [0m[1m[0mencrypted[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      [32m+[0m [0m[1m[0mname[0m[0m         = "baseimage_rhel_7_9_ansible"
      [32m+[0m [0m[1m[0mowner[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mplatform[0m[0m     = "Linux"
      [32m+[0m [0m[1m[0mtags[0m[0m         = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m     = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m      = "0.0.1"
    }

[1m  # module.imagebuilder.aws_imagebuilder_component.this["../baseimages/components/rhel_7_9/packages.yml"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_imagebuilder_component" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mdata[0m[0m         = <<-EOT
            ---
            name: baseimage_rhel_7_9_packages
            description: rhel 7.9 base image component for installing standard packages.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: "0.0.1"
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: InstallPackages
                    action: ExecuteBash
                    inputs:
                      commands:
                        - sudo yum install wget curl unzip git nc ca-certificates gcc screen zlib-devel bzip2-devel openssl-devel libffi-devel  -y
        EOT
      [32m+[0m [0m[1m[0mdate_created[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m  = "rhel 7.9 base image component for installing standard packages."
      [32m+[0m [0m[1m[0mencrypted[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      [32m+[0m [0m[1m[0mname[0m[0m         = "baseimage_rhel_7_9_packages"
      [32m+[0m [0m[1m[0mowner[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mplatform[0m[0m     = "Linux"
      [32m+[0m [0m[1m[0mtags[0m[0m         = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m     = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m      = "0.0.1"
    }

[1m  # module.imagebuilder.aws_imagebuilder_component.this["../baseimages/components/rhel_7_9/python.yml"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_imagebuilder_component" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mdata[0m[0m         = <<-EOT
            ---
            name: baseimage_rhel_7_9_python
            description: rhel 7.9 base image component for installing python
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: "0.0.1"
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: InstallPython3-9
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install python 3.9
                          wget https://www.python.org/ftp/python/3.9.6/Python-3.9.6.tgz
                          tar xzf Python-3.9.6.tgz
                          rm -f Python-3.9.6.tgz
                          cd Python-3.9.6
            
                          # ensure zlib is enabled, required for some ansible modules
                          sed -i 's/^#zlib/zlib/' Modules/Setup
            
                          ./configure --enable-optimizations
                          sudo make altinstall
            
                  # Install pip for Python 3.9
                  - name: InstallPipAndVirtualenv
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
            
                          # install pip and virtualenv
                          python3.9 -m pip install --upgrade pip
                          python3.9 -m pip install virtualenv
        EOT
      [32m+[0m [0m[1m[0mdate_created[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m  = "rhel 7.9 base image component for installing python"
      [32m+[0m [0m[1m[0mencrypted[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      [32m+[0m [0m[1m[0mname[0m[0m         = "baseimage_rhel_7_9_python"
      [32m+[0m [0m[1m[0mowner[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mplatform[0m[0m     = "Linux"
      [32m+[0m [0m[1m[0mtags[0m[0m         = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m     = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m      = "0.0.1"
    }

[1m  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_imagebuilder_distribution_configuration" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mdate_created[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdate_updated[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m  = "shared rhel 7.9 base image"
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = "baseimage_rhel_7_9"
      [32m+[0m [0m[1m[0mtags[0m[0m         = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m     = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }

      [32m+[0m [0mdistribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

[1m  # module.imagebuilder.aws_imagebuilder_image_pipeline.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_imagebuilder_image_pipeline" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mdate_created[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mdate_last_run[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdate_next_run[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdate_updated[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m                      = "shared rhel 7.9 base image"
      [32m+[0m [0m[1m[0mdistribution_configuration_arn[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0menhanced_image_metadata_enabled[0m[0m  = true
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mimage_recipe_arn[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0minfrastructure_configuration_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = "baseimage_rhel_7_9"
      [32m+[0m [0m[1m[0mplatform[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                           = "ENABLED"
      [32m+[0m [0m[1m[0mtags[0m[0m                             = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                         = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }

      [32m+[0m [0mimage_tests_configuration {
          [32m+[0m [0m[1m[0mimage_tests_enabled[0m[0m = false
          [32m+[0m [0m[1m[0mtimeout_minutes[0m[0m     = 720
        }

      [32m+[0m [0mschedule {
          [32m+[0m [0m[1m[0mpipeline_execution_start_condition[0m[0m = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          [32m+[0m [0m[1m[0mschedule_expression[0m[0m                = "cron(0 0 1 * ? *)"
          [32m+[0m [0m[1m[0mtimezone[0m[0m                           = (known after apply)
        }
    }

[1m  # module.imagebuilder.aws_imagebuilder_image_recipe.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_imagebuilder_image_recipe" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mdate_created[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m      = "shared rhel 7.9 base image"
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "baseimage_rhel_7_9"
      [32m+[0m [0m[1m[0mowner[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mparent_image[0m[0m     = "ami-0c2f9865057c3dfe1"
      [32m+[0m [0m[1m[0mplatform[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0muser_data_base64[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m          = "0.0.1"

      [32m+[0m [0mblock_device_mapping {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m = "/dev/sda1"

          [32m+[0m [0mebs {
              [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = "true"
              [32m+[0m [0m[1m[0mencrypted[0m[0m             = "true"
              [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              [32m+[0m [0m[1m[0mvolume_size[0m[0m           = 2
              [32m+[0m [0m[1m[0mvolume_type[0m[0m           = "gp3"
            }
        }

      [32m+[0m [0mcomponent {
          [32m+[0m [0m[1m[0mcomponent_arn[0m[0m = "arn:aws:imagebuilder:eu-west-2:aws:component/update-linux/x.x.x"
        }
      [32m+[0m [0mcomponent {
          [32m+[0m [0m[1m[0mcomponent_arn[0m[0m = "arn:aws:imagebuilder:eu-west-2:aws:component/stig-build-linux-medium/x.x.x"
        }
      [32m+[0m [0mcomponent {
          [32m+[0m [0m[1m[0mcomponent_arn[0m[0m = "arn:aws:imagebuilder:eu-west-2:aws:component/aws-cli-version-2-linux/x.x.x"
        }
      [32m+[0m [0mcomponent {
          [32m+[0m [0m[1m[0mcomponent_arn[0m[0m = "arn:aws:imagebuilder:eu-west-2:aws:component/amazon-cloudwatch-agent-linux/x.x.x"
        }
      [32m+[0m [0mcomponent {
          [32m+[0m [0m[1m[0mcomponent_arn[0m[0m = (known after apply)
        }
      [32m+[0m [0mcomponent {
          [32m+[0m [0m[1m[0mcomponent_arn[0m[0m = (known after apply)
        }
      [32m+[0m [0mcomponent {
          [32m+[0m [0m[1m[0mcomponent_arn[0m[0m = (known after apply)
        }

      [32m+[0m [0msystems_manager_agent {
          [32m+[0m [0m[1m[0muninstall_after_build[0m[0m = false
        }
    }

[1m  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_imagebuilder_infrastructure_configuration" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mdate_created[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mdate_updated[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m                   = "shared rhel 7.9 base image"
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0minstance_profile_name[0m[0m         = "ImageBuilder"
      [32m+[0m [0m[1m[0minstance_types[0m[0m                = [
          [32m+[0m [0m"t3.medium",
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                          = "baseimage_rhel_7_9_0_0_1"
      [32m+[0m [0m[1m[0mresource_tags[0m[0m                 = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0msecurity_group_ids[0m[0m            = [
          [32m+[0m [0m"sg-0987edc89553585ad",
        ]
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = "subnet-014d083e052388b2a"
      [32m+[0m [0m[1m[0mtags[0m[0m                          = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                      = {
          [32m+[0m [0m"amazon-cloudwatch-agent-linux-version" = "1.0.1"
          [32m+[0m [0m"application"                           = "n/a"
          [32m+[0m [0m"aws-cli-version-2-linux-version"       = "1.0.3"
          [32m+[0m [0m"baseimage_rhel_7_9_ansible-version"    = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_packages-version"   = "0.0.1"
          [32m+[0m [0m"baseimage_rhel_7_9_python-version"     = "0.0.1"
          [32m+[0m [0m"branch"                                = "main"
          [32m+[0m [0m"business-unit"                         = "HMPPS"
          [32m+[0m [0m"github-actor"                          = "wullub"
          [32m+[0m [0m"image-pipeline"                        = "baseimage_rhel_7_9"
          [32m+[0m [0m"image-recipe"                          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"infrastructure-configuration"          = "baseimage_rhel_7_9/0.0.1"
          [32m+[0m [0m"is-production"                         = "true"
          [32m+[0m [0m"os-version"                            = "rhel 7.9"
          [32m+[0m [0m"owner"                                 = "digital-studio-operations-team@digital.justice.gov.uk"
          [32m+[0m [0m"release-or-patch"                      = "n/a"
          [32m+[0m [0m"source-code"                           = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/baseimages/rhel_7_9"
          [32m+[0m [0m"stig-build-linux-medium-version"       = "2022.3.2"
          [32m+[0m [0m"update-linux-version"                  = "1.0.2"
        }
      [32m+[0m [0m[1m[0mterminate_instance_on_failure[0m[0m = true

      [32m+[0m [0mlogging {
          [32m+[0m [0ms3_logs {
              [32m+[0m [0m[1m[0ms3_bucket_name[0m[0m = "ec2-image-builder-logs-20211019134837153100000001"
              [32m+[0m [0m[1m[0ms3_key_prefix[0m[0m  = "baseimage"
            }
        }
    }

[0m[1mPlan:[0m 7 to add, 0 to change, 0 to destroy.
[0m
```